Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions
Multiple filleting options for centerline curves

Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions.UntrimmedSegments
Centerline curves are un-trimmed and un-filleted at corners.

Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions.IncludeDrawnArcs
Un-filleted centerline curves, but include user-drawn arcs in the RebarShape family.

Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions.IncludeFillets
Centerline curves computed with all fillets between curves.